saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/GigaDevice.GD32F1x0_DFP.3.1.1.pdsc
        <!-- *************************  Device 'GD32F170C4'  ***************************** -->
        <device Dname="GD32F170C4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1" />
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170C6'  ***************************** -->
        <device Dname="GD32F170C6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170C8'  ***************************** -->
        <device Dname="GD32F170C8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170T4'  ***************************** -->
        <device Dname="GD32F170T4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170T6'  ***************************** -->
        <device Dname="GD32F170T6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170T8'  ***************************** -->
        <device Dname="GD32F170T8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170R8'  ***************************** -->
        <device Dname="GD32F170R8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'GD32F190'  **************************** -->
      <subFamily DsubFamily="GD32F190">
        <processor Dclock="72000000"/>
        <compile header="Device/Include/gd32f1x0.h" define="GD32F170_190"/>
        <debug svd="SVD/GD32F1x0.svd"/>        
        <description>
        GD32F190 - ARM Cortex-M3 Core
           Frequency up to 72 MHz
           Flash access zero wait state
           Single-cycle multiplier and hardware divider

         Memories
            Flash size from 16KB to 128 KB
            SRAM size from 4KB to 8 KB with HW parity checking
            3KB ISP loader ROM
        </description>
            <feature type="IOs"                    n="55"/>
            <feature type="Timer"                 n="1"                m="16"                name="Basic Timer"/>
            <feature type="I2S"                    n="2"                                           name="DAC"/>
            <feature type="Touch"                 n="18"                                         name="Capacitive Touch Inputs"/>
            <feature type="LCD"                   n="1"                 m="8.32"             name="Segment LCD Controller"/>
            <feature type="DAC"                   n="2"                m="10"                name="DAC"/>
            <feature type="CAN"                   n="2"                                           name="CAN 2.0b Controller"/>
            <feature type="I2C"                    n="3"                                           name="Low-Power I2C"/>
            <feature type="SPI"                    n="3"                                           name="SPI Interface"/>
            <feature type="Other"                 n="2"                                           name="My other Interface"/>
            <feature type="VCC"                   n="2.5"             m="5.5"               name="Voltage"/>
            <feature type="NVIC"                  n="74"                                         name="NVIC"/>
            <feature type="Consumption"                               m="0.000059"      name="Ultra-Low Power Consumption"/>

        <!-- *************************  Device 'GD32F190C4'  ***************************** -->
        <device Dname="GD32F190C4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

