saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/GigaDevice.GD32F1x0_DFP.3.1.1.pdsc
        <!-- *************************  Device 'GD32F190C6'  ***************************** -->
        <device Dname="GD32F190C6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190C8'  ***************************** -->
        <device Dname="GD32F190C8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

       <!-- *************************  Device 'GD32F190R4'  ***************************** -->
        <device Dname="GD32F190R4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190R6'  ***************************** -->
        <device Dname="GD32F190R6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190R8'  ***************************** -->
        <device Dname="GD32F190R8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T4'  ***************************** -->
        <device Dname="GD32F190T4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T6'  ***************************** -->
        <device Dname="GD32F190T6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T8'  ***************************** -->
        <device Dname="GD32F190T8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
     </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F1x0">
      <description>GigaDevice GD32F1x0 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F1[3579]0*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F1x0 CMSIS">
      <description>GigaDevice GD32F1x0 Devices and CMSIS-CORE</description>
      <require condition="GD32F1x0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32F1x0_libopt"/>    
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="RCU"/>           
    </condition>

    <!-- GD32F1x0 STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F1x0 STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F1x0 Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F1x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F1x0 STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F1x0 STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F1x0 Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F1x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F1x0 STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F1x0 STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F1x0 Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F1x0 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="USART"/>
      <require Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="SYSCFG"/>
    </condition>
