saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/GigaDevice.GD32F1x0_DFP.3.1.1.pdsc
  </conditions>

  <components>
    <!-- GD32F1x0_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="ADC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_adc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_adc.c" attr="config" version="3.1.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CAN" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_can.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CEC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Consumer Electronics Control (CEC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CEC
        </RTE_Components_h>
        <files>
          <!-- CEC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_cec.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_cec.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CRC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_crc.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="CMP" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Comparator (CMP) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
        <files>
          <!-- CMP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_cmp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_cmp.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="DAC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_dac.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="MCUDBG" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>MCU Debug (MCUDBG) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- MCUDBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_dbg.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="DMA" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_dma.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="EXTI" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_exti.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="FMC" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_fmc.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="GPIO" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_gpio.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="SYSCFG" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>System Configuration (SYSCFG) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- SYSCFG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_syscfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_syscfg.c" attr="config" version="3.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="I2C" Cversion="3.1.0" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_i2c.c" attr="config" version="3.1.0" />
        </files>
    </component>

